In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('heroes.csv')

In [4]:
df

      이름  나이     직업     국적    키            재산
0   아이언맨  58    CEO     미국  174  1.150000e+13
1     토르  45      신  아스가르드  190           NaN
2  스파이더맨  18   고등학생     미국  177  6.000000e+02
3   원더우먼  27     공주  데미스키라  178           NaN
4     헐크  33  핵물리학자     미국  270  1.000000e+09
5   캡틴마블  25    파일럿     미국  170  3.400000e+08
6  블랙위도우  32    스파이    러시아  170  5.000000e+07

In [14]:

    

df['키']=df['키'].apply(lambda a: str(a) + 'cm')

In [15]:
df.groupby('국적')['나이'].mean()

국적
데미스키라    27.0
러시아      32.0
미국       33.5
아스가르드    45.0
Name: 나이, dtype: float64